{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u008c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "input_dtype": "float32", "trainable": true, "name": "lambda_1", "batch_input_shape": [null, 16, 32, 1], "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "input_dtype": "float32", "dim_ordering": "tf", "subsample": [1, 1], "batch_input_shape": [null, 16, 32, 1], "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "border_mode": "valid", "name": "convolution2d_1", "trainable": true, "nb_col": 3, "nb_filter": 2, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "strides": [4, 4]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "output_dim": 2, "activation": "linear", "W_constraint": null, "bias": true, "trainable": true, "name": "dense_1", "init": "glorot_uniform", "input_dim": 42, "activity_regularizer": null}}], "keras_version": "1.2.1"}