{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "output_shape": null, "output_shape_type": "raw", "input_dtype": "float32", "name": "lambda_1", "trainable": true, "batch_input_shape": [null, 16, 32, 1], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0011model_throttle.py\u00da\b<lambda>\u008c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "input_dtype": "float32", "activation": "relu", "name": "convolution2d_1", "subsample": [1, 1], "trainable": true, "b_regularizer": null, "nb_filter": 2, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "batch_input_shape": [null, 16, 32, 1], "bias": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "border_mode": "valid", "name": "maxpooling2d_1", "strides": [4, 4], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 2, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "input_dim": 42, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "bias": true}}], "keras_version": "1.2.1"}